---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentChangedEventArgs
source: html/8fd170b2-df48-209b-438e-54ec7b01b664.htm
---
# Autodesk.Revit.DB.Events.DocumentChangedEventArgs

The event arguments used by the DocumentChanged event.

## Syntax (C#)
```csharp
public class DocumentChangedEventArgs : RevitAPISingleEventArgs
```